Public Attributes | List of all members
API_Interval Struct Reference
Element Manager API
Describes an interval with handling possible periodicity. More...
#include <APIdefs_Base.h>
 Public Attributes
double  | lower
Lower bound of the interval.
double  | upper
Upper bound of the interval.
double  | periodicity
Interval Length if it is circular.
Detailed Description
Describes an interval with handling possible periodicity.
Remarks
None
Member Data Documentation
◆ lower
 API_Interval::lower
Lower bound of the interval.
◆ periodicity
 API_Interval::periodicity
Interval Length if it is circular.
◆ upper
 API_Interval::upper
Upper bound of the interval.